Name - Vo Thien Hai Le - 30006085 - v.le@constructor.university

In [3]:
import sqlite3

conn = sqlite3.connect('Example.db')

In [4]:
# c = conn.execute('''SELECT * FROM students''')
# c.fetchall()

import pandas
pandas.read_sql_query('''SELECT * FROM students''', conn)

   student_id        name  age  gender
0           1    John Doe   20    Male
1           2  Jane Smith   22  Female
2           3   Bob Green   21    Male
3           4  Lisa Brown   19  Female
4           5     Tom Lee   23    Male

In [5]:
# 1. Write an SQL query to find the names and ages of all female students.

pandas.read_sql_query('''SELECT * FROM students WHERE gender="Female"''', conn)

   student_id        name  age  gender
0           2  Jane Smith   22  Female
1           4  Lisa Brown   19  Female

In [6]:
# 2. Write an SQL query to find the names of all courses taught by female instructors.

pandas.read_sql_query('''SELECT DISTINCT instructor FROM courses''', conn)

    instructor
0    Mr. Smith
1  Ms. Johnson
2    Dr. Green
3    Ms. Brown

In [73]:
# 3. Write an SQL query to find the name and grade of the student with student_id = 2.

pandas.read_sql_query('''SELECT students.name, enrollments.grade FROM enrollments 
JOIN students ON students.student_id = enrollments.student_id WHERE students.student_id = 2''', conn)

         name grade
0  Jane Smith     B
1  Jane Smith     A
2  Jane Smith     C

In [11]:
# 4. Write an SQL query to find the average age of male students.

pandas.read_sql_query('''SELECT AVG(age) FROM students WHERE gender="Male"''', conn)

    AVG(age)
0  21.333333

In [12]:
# 5. Write an SQL query to find the names and ages of the three youngest students.

pandas.read_sql_query('''SELECT name, age FROM students ORDER BY age ASC LIMIT 3 ''', conn)

         name  age
0  Lisa Brown   19
1    John Doe   20
2   Bob Green   21

In [25]:
# 6. Write an SQL query to find the names of students who are enrolled in more than two courses.

pandas.read_sql_query('''SELECT students.name FROM students INNER JOIN enrollments 
ON enrollments.student_id = students.student_id GROUP BY students.student_id 
HAVING COUNT(DISTINCT enrollments.course_id)>2 ''', conn)

         name
0    John Doe
1  Jane Smith

In [29]:
# 7. Write an SQL query to find the names of courses and their average grade, 
# sorted in descending order of average grade.

pandas.read_sql_query('''SELECT courses.name, enrollments.grade FROM courses 
INNER JOIN enrollments ON courses.course_id = enrollments.course_id GROUP BY courses.name 
ORDER BY enrollments.grade DESC''', conn)

          name grade
0  History 101     C
1     Math 101     B
2  Science 101     A
3  English 101     A

In [87]:
# 8. Write an SQL query to find the names of students and the names of courses they are enrolled in, 
# sorted by student name.

pandas.read_sql_query('''SELECT DISTINCT students.name, courses.name FROM students 
INNER JOIN enrollments ON students.student_id = enrollments.student_id 
INNER JOIN courses ON enrollments.course_id = courses.course_id
ORDER BY students.name''', conn)

          name         name
0    Bob Green     Math 101
1    Bob Green  Science 101
2   Jane Smith  English 101
3   Jane Smith     Math 101
4   Jane Smith  History 101
5     John Doe  English 101
6     John Doe     Math 101
7     John Doe  Science 101
8   Lisa Brown  English 101
9   Lisa Brown  Science 101
10     Tom Lee     Math 101
11     Tom Lee  History 101

In [88]:
# 9. Write an SQL query to find the number of male and female students.
pandas.read_sql_query('''SELECT gender,COUNT(students.gender)AS count FROM Students GROUP BY gender''', conn)

   gender  count
0  Female      2
1    Male      3

In [53]:
# 10. Write an SQL query to find the names of students who are enrolled in both English 101 and Math 101 courses.

In [93]:
pandas.read_sql_query('''SELECT students.name FROM students 
INNER JOIN enrollments ON students.student_id = enrollments.student_id 
WHERE enrollments.course_id = 1 AND students.student_id IN(SELECT students.student_id 
FROM students JOIN enrollments ON students.student_id = enrollments.student_id 
WHERE enrollments.course_id = 2)''', conn)

         name
0    John Doe
1  Jane Smith